#include "stm32f10x.h"


//置位  |=  
//清零  &=~
int main (void)
{
#if 0
	//led0在PB5引脚上
	
	//开启时钟，时钟挂载在AHB总线上
	*(unsigned int*)0x40021018 |= ((1)<<3);
	
	//配置输出模式CRL（PB5的5<8所以为端口普配置低寄存器）（四位为一组所以4*5）（推挽输出）
	*(unsigned int*)0X40010C00 |= ((1)<<(4*5));
	
	//设置端口输出寄存器ODR为输出低电平
	*(unsigned int*)0X40010C0C &= ~(1<<5);
#else
		//开启时钟，时钟挂载在AHB总线上
	RCC_APB2ENR |= ((1)<<3);
	
	//配置输出模式CRL（PB5的5<8所以为端口普配置低寄存器）（四位为一组所以4*5）（推挽输出）
	//建议加上寄存器复位代码
	GPIOB_CRL &=~ ((0x0F)<<(4*5));//清零
	GPIOB_CRL |= ((1)<<(4*5));
	
	//设置端口输出寄存器ODR为输出低电平
	//建议加上寄存器复位代码
	GPIOB_ODR &=~ ((1)<<(5));//清零
	GPIOB_ODR &= ~(1<<5);

#endif

}



void SystemInit(void)
{
	// 函数体为空，目的是为了骗过编译器不报错
}
